import '../styles/header.css';
import '../styles/contact.css';
import Header from "../components/Header";
import Footer from "../components/Footer";
import React from "react";

export default function AboutPage() {
    return (
        <div>
            <Header />
            <div className="wrapper" style={{
                display: "flex",
                justifyContent: "center",
                alignItems: "center",
                flexDirection: "column",
                height: "fit-content",
            }}>
                <div className="info-container" style={{
                    width: "70%",
                    height: "auto",
                    margin: "20px"
                }}>
                    <p className="value">Ласкаво просимо до MovieMapUA – вашого вірного провідника у захопливий світ кіно та найвідоміших місць зйомок в Україні та світі. Відкрийте для себе неймовірні історії за кадром і підкоріть нові горизонти в світі кіномистецтва та подорожей. Рушайте у незабутню мандрівку крізь найяскравіші моменти кінематографу, дізнайтеся про локації, де знімали ваші улюблені фільми, та пориньте в неповторну атмосферу місць, де оживали найпам’ятніші сюжети.</p>

                        <p className="value">Приєднуйтесь до нашої захопливої мандрівки у світ кіно та мандрів! Разом ми розширимо обрії, занурившись у таємниці кіновиробництва та ділячись захопленням з однодумцями. Відвідайте місця, які оживили на екранах улюблені фільми, та розкрийте історії, що криються за кожною сценою. Відкривайте для себе архітектурні дива, мальовничі краєвиди та культурні скарби, які прикрашають кінематографічні шедеври. Рушаймо разом у незабутню подорож за межі екрану, відчуваючи чари кіно у реальному житті!</p>
                    <p className="value">На нашому сайті на вас чекає безліч захоплюючих можливостей для вивчення світу кіно та подорожей. Ви зможете скористатися інтерактивними мапами з відмітками локацій, де знімалися відомі фільми, що дозволить вам легко знайти та відвідати ці місця. Окрім цього, зможете будувати маршрути, переглядати рекомендації готелів та екскурсій, а також повноцінно планувати подорожі.</p>

                    <p className="value">На нашій платформі ви зможете коментувати фільми, ділитися своїми враженнями та обговорювати улюблені сцени з іншими кіноентузіастами. Ваші думки та відгуки допоможуть створити активну та дружню спільноту однодумців. Крім того, ви зможете додавати нові фільми на вебсайт, розширюючи нашу колекцію та допомагаючи іншим користувачам відкривати для себе нові шедеври кінематографу. Ваші доповнення та рекомендації стануть цінним внеском у розвиток нашої платформи.</p>

                    <p className="value">Над проєктом працювала студентка групи ПМІ-44 Гаплик Галина. Львівський Національний Університет імені Івана Франка. Факультет прикладної математики та інформатики. Кафедра інформаційних систем. 2025 рік.  </p>
                </div>
                </div>
            <Footer />
        </div>
    );
}